Repository: Abhigyan-GG/Digi_Kul_TeachersPortal
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: hi

source: Digi Kul
hi: डिजी कुल

source: Welcome, %(name)s • %(type)s
hi: स्वागत है, %(name)s • %(type)s

source: Admin Dashboard
hi: एडमिन डैशबोर्ड

source: Teacher Dashboard
hi: शिक्षक डैशबोर्ड

source: Student Dashboard
hi: छात्र डैशबोर्ड

source: Logout
hi: लॉग आउट

source: Welcome to Digi Kul
hi: डिजी कुल में आपका स्वागत है

source: A simple portal for teachers and students
hi: शिक्षकों और छात्रों के लिए एक सरल पोर्टल

source: Admin Login
hi: एडमिन लॉगिन

source: Login
hi: लॉगिन

source: Go to Teacher Dashboard
hi: शिक्षक डैशबोर्ड पर जाएं

source: Go to Admin Dashboard
hi: एडमिन डैशबोर्ड पर जाएं

source: Go to Student Dashboard
hi: छात्र डैशबोर्ड पर जाएं

source: DigiKul Highlights
hi: डिजीकुल की विशेषताएं

source: Low-bandwidth e-learning built for reliability
hi: विश्वसनीयता के लिए निर्मित कम बैंडविड्थ ई-लर्निंग

source: Audio-first live classes
hi: ऑडियो-प्रथम लाइव कक्षाएं

source: Adaptive quality
hi: अनुकूली गुणवत्ता

source: Offline downloads
hi: ऑफलाइन डाउनलोड

source: Device-to-device sharing
hi: डिवाइस-टू-डिवाइस शेयरिंग

source: Push-to-talk
hi: पुश-टू-टॉक

source: Real-time chat & quizzes
hi: रियल-टाइम चैट और क्विज़

source: 🔴 Checking server status...
hi: 🔴 सर्वर स्थिति जांच रहे हैं...

source: 🟢 Server Online - Active Sessions: %(sessions)s
hi: 🟢 सर्वर ऑनलाइन - सक्रिय सत्र: %(sessions)s

source: 🔴 Server Offline
hi: 🔴 सर्वर ऑफलाइन

source: Login to Digi Kul
hi: डिजी कुल में लॉगिन करें

source: Enter your credentials to access your account
hi: अपने खाते तक पहुंचने के लिए अपनी साख दर्ज करें

source: Email Address
hi: ईमेल पता

source: Password
hi: पासवर्ड

source: User Type
hi: उपयोगकर्ता प्रकार

source: Teacher
hi: शिक्षक

source: Student
hi: छात्र

source: Admin
hi: एडमिन

source: Don't have an account?
hi: खाता नहीं है?

source: Register here
hi: यहां रजिस्टर करें

source: Register for Digi Kul
hi: डिजी कुल के लिए रजिस्टर करें

source: Create your account to get started
hi: शुरू करने के लिए अपना खाता बनाएं

source: Full Name
hi: पूरा नाम

source: Institution
hi: संस्थान

source: Subject (for teachers)
hi: विषय (शिक्षकों के लिए)

source: Confirm Password
hi: पासवर्ड की पुष्टि करें

source: Register
hi: रजिस्टर

source: Already have an account?
hi: पहले से खाता है?

source: Login here
hi: यहां लॉगिन करें

source: Manage your lectures and teaching materials
hi: अपने व्याख्यान और शिक्षण सामग्री का प्रबंधन करें

source: Access your lectures and learning materials
hi: अपने व्याख्यान और सीखने की सामग्री तक पहुंचें

source: Manage users, cohorts, and system settings
hi: उपयोगकर्ताओं, समूहों और सिस्टम सेटिंग्स का प्रबंधन करें

source: Logged Out Successfully
hi: सफलतापूर्वक लॉग आउट

source: You have been securely logged out of your account.
hi: आपको अपने खाते से सुरक्षित रूप से लॉग आउट कर दिया गया है।

source: Return to Home
hi: होम पर वापस जाएं

source: Login Again
hi: फिर से लॉगिन करें

source: Live Session
hi: लाइव सत्र

source: Join the live classroom session
hi: लाइव कक्षा सत्र में शामिल हों

source: Manage Live Session
hi: लाइव सत्र का प्रबंधन करें

source: Control your live classroom session
hi: अपने लाइव कक्षा सत्र को नियंत्रित करें

source: Join Live Session
hi: लाइव सत्र में शामिल हों

source: Participate in the live classroom session
hi: लाइव कक्षा सत्र में भाग लें

source: Language
hi: भाषा

source: English
hi: अंग्रेजी

source: Welcome
hi: स्वागत

source: Welcome Back
hi: वापस स्वागत है

source: Sign in to your Digi Kul account
hi: अपने डिजी कुल खाते में साइन इन करें

source: Enter your email address
hi: अपना ईमेल पता दर्ज करें

source: Enter your password
hi: अपना पासवर्ड दर्ज करें

source: Select your role
hi: अपनी भूमिका चुनें

source: Sign In
hi: साइन इन

source: Need admin access?
hi: एडमिन एक्सेस चाहिए?

source: Access admin dashboard
hi: एडमिन डैशबोर्ड तक पहुंचें

source: My Lectures
hi: मेरे व्याख्यान

source: My Cohorts
hi: मेरे समूह

source: Create Lecture
hi: व्याख्यान बनाएं

source: Upload Materials
hi: सामग्री अपलोड करें

source: Live Sessions
hi: लाइव सत्र

source: Create Lecture for Cohort
hi: समूह के लिए व्याख्यान बनाएं

source: Students in Cohort
hi: समूह में छात्र

source: Upload Material
hi: सामग्री अपलोड करें

source: Manage Polls
hi: पोल प्रबंधित करें

source: View Students
hi: छात्र देखें

source: Students
hi: छात्र

source: Available Lectures
hi: उपलब्ध व्याख्यान

source: Enrolled Lectures
hi: नामांकित व्याख्यान

source: Polls
hi: पोल

source: Join cohorts to access lectures and materials
hi: व्याख्यान और सामग्री तक पहुंचने के लिए समूह में शामिल हों

source: Browse and enroll in available lectures
hi: उपलब्ध व्याख्यान ब्राउज़ करें और नामांकन करें
